<html>
	<head>
		<title>.:: TAREA 1 ::.</title>
	</head>
	<body>
		<h1><font face="Top Secret"><big>TAREA 1</big></font></h1>
		<a name="Inicio"></a>
		<hr align="center" size="1">
		<h2><marquee bgcolor="black" behavior="alternate" direction="right">
			<font face="Algerian" color="#FFFFF"><b>Programaci&oacute;n</b></font>
		</marquee></h2>
		<img src="img/lenguajes-programacion.jpg" alt="Lenguaje de programación" width="300" height="200" style="float:left; margin: 5 15px;">
		<p align="justify"><font face="Arial">
			La <i>programaci&oacute;n</i> es un proceso que se utiliza para <u>idear y ordenar</u> las acciones que se
			realizar&aacute;n en el marco de un proyecto; al anuncio de las partes que componen un acto o
			espect&aacute;culo; a la preparaci&oacute;n de m&aacute;quinas para que cumplan con una cierta tarea en un
			momento determinado; a la elaboraci&oacute;n de programas para la <u>resoluci&oacute;n de problemas</u>
			mediante ordenadores; y a la preparaci&oacute;n de los datos necesarios para obtener una soluci&oacute;n de un problema.<br><br>
			
			En la actualidad, la noci&oacute;n de programaci&oacute;n se encuentra muy asociada a la creaci&oacute;n de
			<u>aplicaciones inform&aacute;ticas</u> y videojuegos; es el proceso por el cual una persona desarrolla
			un programa vali&eacute;ndose de una herramienta que le permita escribir el c&oacute;digo (el cual puede
			estar en uno o varios lenguajes, tales como C++, Java, Python entre otros) y de otra que
			sea capaz de "traducirlo" a lo que se conoce como lenguaje de m&aacute;quina, el cual puede ser entendido por un microprocesador. 			
		</font></p>
		<hr align="center" size="1"> 
		<h2><marquee bgcolor="#f1a310" behavior="alternate" direction="left">
			<font face="Algerian" color="black"><b>Videojuego</b></font>
		</marquee></h2>
		<img src="img/pac-man.jpg" alt="PacMan, un videojuego" width="300" height="200" style="float:right; margin: 5 15px;">
		<p align="justify"><font face="Arial">
			Un <i>videojuego</i> o juego de video es un juego electr&oacute;nico en el que una o m&aacute;s personas <u>interact&uacute;an,
			por medio de un controlador, con un dispositivo que muestra im&aacute;genes de video</u>. Este dispositivo
			electr&oacute;nico, conocido gen&eacute;ricamente como "plataforma", puede ser una computadora, una m&aacute;quina arcade,
			una videoconsola o un dispositivo port&aacute;til (un tel&eacute;fono m&oacute;vil, por ejemplo). Los videojuegos son,
			a&nacute;o por año, una de las principales industrias del <u>arte y el entretenimiento</u>.<br><br>

			Generalmente, los videojuegos hacen uso de otras maneras, aparte de la imagen, de proveer la
			<u>interactividad e informaci&oacute;n al jugador</u>. El audio es casi universal, us&aacute;ndose dispositivos de
			reproducci&oacute;n de sonido, tales como altavoces y auriculares. Otro tipo de realimentaci&oacute;n se hace a
			trav&eacute;s de perif&eacute;ricos h&aacute;pticos que producen vibraci&oacute;n o retroalimentaci&oacute;n de fuerza,
			us&aacute;ndose a veces	la vibraci&oacute;n para simular la retroalimentaci&oacute;n de fuerza. 			
		</font></p>
		<hr align="center" size="1">
		<a href="#Inicio"><font face="Impact">Volver al inicio</font></a><p align="right"><a href="games.html"><font face="Impact">Algunos juegos</font></p>
	</body>
</html>